OP-AMINUL-FF/OPX_my_demon/NETHERCAP_ESP8266/attacks.h
#ifndef ATTACKS_H
#define ATTACKS_H

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <DNSServer.h>
#include <LittleFS.h>
#include "config.h"

extern "C" {
  #include "user_interface.h"
}

void addLog(String msg, uint8_t level = LOG_INFO);
bool flushLogs();
String bytesToStr(const uint8_t* b, uint32_t size);
void sendDeauth(uint8_t ch, uint8_t* bssid, int burstCount);

struct Network {
  String ssid;
  uint8_t ch;
  uint8_t bssid[6];
  int rssi;
  bool encrypted;
  bool wpa3;
  bool pmf;
  uint8_t clients;
};

Network networks[MAX_NETWORKS];
Network selectedNetwork;
Network multiTargets[MAX_NETWORKS];
int multiTargetCount = 0;

bool deauthingActive = false;
bool beaconActive = false;
bool probeActive = false;
bool hotspotActive = false;
bool scanning = false;

String capturedPasswords[CAPTURED_MAX];
int capturedCount = 0;
uint8_t currentPhishingPage = PHISHING_LANDING;

bool hijackActive = false;
bool extenderActive = false;
bool deauthAllActive = false;
bool preciseDeauthActive = false;
bool trueDeauthActive = false;
bool rogueAPActive = false;
bool apHidden = false;

unsigned long lastScan = 0;
unsigned long lastDeauth = 0;
unsigned long lastBeacon = 0;
unsigned long lastProbe = 0;
unsigned long lastHijack = 0;
unsigned long lastDeauthAll = 0;
unsigned long lastPreciseDeauth = 0;
unsigned long lastTrueDeauth = 0;
unsigned long lastChannelHop = 0;
uint8_t currentChannel = 1;

unsigned long lastStateSave = 0;
bool dirtyState = false;

bool wifiClientConnected = false;
String wifiClientSSID = "";
String wifiClientPassword = "";
int wifiClientStatus = WL_DISCONNECTED;
bool internetSharingEnabled = false;

String beaconSSIDs[MAX_SSIDS];
int beaconSSIDCount = 0;
int displayTimeout = 60;
bool autoSelectAll = false;

// --- Probe Monitor ---
struct ProbeEntry {
  uint8_t mac[6];
  String ssid;
  unsigned long time;
};
ProbeEntry probeLog[PROBE_MAX];
int probeCount = 0;

// --- Client Discovery ---
struct ClientEntry {
  uint8_t mac[6];
  uint8_t bssid[6];
  int ch;
  unsigned long time;
};
ClientEntry clientList[CLIENT_MAX];
int clientCount = 0;

// --- DNS Query Log (for Evil-Twin) ---
struct DNSEntry {
  String domain;
  uint8_t clientMAC[6];
  unsigned long time;
};
DNSEntry dnsLog[DNS_LOG_MAX];
int dnsLogCount = 0;

  // --- EAPOL / WPA Handshake Detection ---
#define EAPOL_MAX 4
#define PCAP_GLOBAL_HEADER_LEN 24
#define PCAP_PKT_HEADER_LEN 16
struct EAPOLEntry {
  uint8_t bssid[6];
  uint8_t clientMAC[6];
  uint8_t messageType;
  unsigned long time;
  uint8_t rawData[256];
  uint16_t rawLen;
};
EAPOLEntry eapolLog[EAPOL_MAX];
int eapolCount = 0;
bool handshakeCaptureActive = false;
unsigned long handshakeCaptureStart = 0;
uint8_t handshakeTargetBSSID[6];
uint8_t handshakeTargetCH = 0;
bool handshakeComplete = false;

static void saveHandshakeBinary() {
  File f = LittleFS.open("/capture.pcap", "w");
  if (!f) return;
  uint8_t pcapHdr[24] = {
    0xD4, 0xC3, 0xB2, 0xA1, 0x02, 0x00, 0x04, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0xFF, 0xFF, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00
  };
  f.write(pcapHdr, 24);
  for (int i = 0; i < eapolCount; i++) {
    if (eapolLog[i].rawLen > 0) {
      uint32_t ts_sec = eapolLog[i].time / 1000;
      uint32_t ts_usec = (eapolLog[i].time % 1000) * 1000;
      uint8_t pktHdr[16];
      memcpy(pktHdr, &ts_sec, 4);
      memcpy(pktHdr + 4, &ts_usec, 4);
      memcpy(pktHdr + 8, &eapolLog[i].rawLen, 4);
      memcpy(pktHdr + 12, &eapolLog[i].rawLen, 4);
      f.write(pktHdr, 16);
      f.write(eapolLog[i].rawData, eapolLog[i].rawLen);
    }
  }
  f.close();
  addLog("Handshake saved to /capture.pcap (" + String(eapolCount) + " frames)", LOG_WARN);
}

// --- Extender State Machine ---
enum ExtenderState {
  EXTENDER_IDLE,
  EXTENDER_SCANNING,
  EXTENDER_CONNECTING,
  EXTENDER_CONNECTED,
  EXTENDER_ERROR
};
ExtenderState extenderState = EXTENDER_IDLE;
unsigned long extenderConnectStart = 0;
String extenderTargetSSID = "";
String extenderTargetPass = "";

// --- WiFi Connect State Machine ---
enum WiFiConnectState {
  WIFI_IDLE,
  WIFI_CONNECTING,
  WIFI_RECONNECTING
};
WiFiConnectState wifiConnState = WIFI_IDLE;
String wifiPendingSSID = "";
String wifiPendingPass = "";
unsigned long wifiConnectStart = 0;

unsigned long deauthPkts = 0;
unsigned long beaconPkts = 0;
unsigned long probePkts = 0;
unsigned long totalPkts = 0;

// --- Multi-page Evil-Twin ---
int phishingStep = 0; // 0 = first page, 1 = second page, etc.
String phishingSessionId = "";

// --- Reactive Phishing Verification ---
uint8_t phishingVerifyState = PHISHING_VERIFY_IDLE;
unsigned long phishingVerifyStart = 0;

// --- XXTEA Encryption (replaces simple XOR) ---
static void xxteaEncrypt(uint32_t* v, int n, const uint32_t* key) {
  uint32_t y, z, sum, delta = 0x9E3779B9;
  int rounds = 6 + 52 / n;
  sum = 0; y = v[0];
  do {
    sum += delta;
    uint32_t e = (sum >> 2) & 3;
    for (int p = 0; p < n - 1; p++) {
      z = v[p + 1];
      v[p] += ((z >> 5 ^ y << 2) + (y >> 3 ^ z << 4)) ^ ((sum ^ y) + (key[(p & 3) ^ e] ^ z));
      y = v[p];
    }
    z = v[0];
    v[n - 1] += ((z >> 5 ^ y << 2) + (y >> 3 ^ z << 4)) ^ ((sum ^ y) + (key[(n - 1 & 3) ^ e] ^ z));
    y = v[n - 1];
  } while (--rounds);
}

static void xxteaDecrypt(uint32_t* v, int n, const uint32_t* key) {
  uint32_t y, z, sum, delta = 0x9E3779B9;
  int rounds = 6 + 52 / n;
  sum = rounds * delta; y = v[0];
  do {
    uint32_t e = (sum >> 2) & 3;
    for (int p = n - 1; p > 0; p--) {
      z = v[p - 1];
      v[p] -= ((z >> 5 ^ y << 2) + (y >> 3 ^ z << 4)) ^ ((sum ^ y) + (key[(p & 3) ^ e] ^ z));
      y = v[p];
    }
    z = v[n - 1];
    v[0] -= ((z >> 5 ^ y << 2) + (y >> 3 ^ z << 4)) ^ ((sum ^ y) + (key[(0 & 3) ^ e] ^ z));
    y = v[0];
    sum -= delta;
  } while (--rounds);
}

static uint8_t xxteaKey[16] = {0};

static void initXXTEAKey() {
  uint8_t mac[MAC_LEN] = {0};
  WiFi.macAddress(mac);
  uint32_t chipId = ESP.getChipId();
  uint32_t flashId = ESP.getFlashChipId() ^ 0x5A5A5A5A;
  for (int i = 0; i < 16; i++) {
    uint8_t idByte = (uint8_t)(chipId >> ((i * 5) % 28)) ^ (uint8_t)(flashId >> ((i * 7) % 28));
    xxteaKey[i] = mac[i % MAC_LEN] ^ idByte ^ (uint8_t)(0xA5 + i * 7);
  }
}

static String encryptString(const String& input) {
  if (xxteaKey[0] == 0) initXXTEAKey();
  int len = input.length();
  if (len == 0) return input;
  int paddedLen = ((len + 3) / 4 + 1) * 4;
  uint32_t* buf = (uint32_t*)malloc(paddedLen);
  memset(buf, 0, paddedLen);
  memcpy(buf, input.c_str(), len);
  buf[paddedLen / 4 - 1] = len;
  int n = paddedLen / 4;
  xxteaEncrypt(buf, n, (uint32_t*)xxteaKey);
  String result;
  result.reserve(paddedLen + 4);
  result += (char)(n & 0xFF);
  result += (char)((n >> 8) & 0xFF);
  result += (char)((n >> 16) & 0xFF);
  result += (char)((n >> 24) & 0xFF);
  for (int i = 0; i < paddedLen; i++) {
    result += (char)(((uint8_t*)buf)[i]);
  }
  free(buf);
  return result;
}

static String decryptString(const String& input) {
  if (xxteaKey[0] == 0) initXXTEAKey();
  if (input.length() < 4) return input;
  int n = (uint8_t)input[0] | ((uint8_t)input[1] << 8) | ((uint8_t)input[2] << 16) | ((uint8_t)input[3] << 24);
  int paddedLen = n * 4;
  if (paddedLen <= 0 || paddedLen > 512 || (unsigned int)paddedLen + 4 > input.length()) return input;
  uint32_t* buf = (uint32_t*)malloc(paddedLen);
  for (int i = 0; i < paddedLen; i++) {
    ((uint8_t*)buf)[i] = input[4 + i];
  }
  xxteaDecrypt(buf, n, (uint32_t*)xxteaKey);
  int origLen = buf[n - 1];
  if (origLen > paddedLen || origLen < 0) { free(buf); return input; }
  String result;
  result.reserve(origLen);
  for (int i = 0; i < origLen; i++) result += (char)((uint8_t*)buf)[i];
  free(buf);
  return result;
}

// --- Input Sanitization (2026 hardening) ---
static String sanitizeInput(const String& input, size_t maxLen = 128) {
  String out;
  out.reserve(min(input.length(), maxLen));
  for (size_t i = 0; i < input.length() && out.length() < maxLen; i++) {
    char c = input[i];
    if (c >= 0x20 && c < 0x7F) {
      if (c == '<') { out += "&lt;"; }
      else if (c == '>') { out += "&gt;"; }
      else if (c == '"') { out += "&quot;"; }
      else if (c == '\'') { out += "&#39;"; }
      else if (c == '&') { out += "&amp;"; }
      else { out += c; }
    }
  }
  return out;
}

static String sanitizeNumeric(const String& input) {
  String out;
  out.reserve(input.length());
  for (size_t i = 0; i < input.length(); i++) {
    if (input[i] >= '0' && input[i] <= '9') out += input[i];
  }
  return out;
}

static String sanitizeFilename(const String& input) {
  String out;
  out.reserve(input.length());
  for (size_t i = 0; i < input.length(); i++) {
    char c = input[i];
    if ((c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
        (c >= '0' && c <= '9') || c == '.' || c == '_' || c == '-' || c == '/') {
      out += c;
    }
  }
  return out;
}

// --- Adaptive Signal Strength (2026 stealth) ---
static int8_t targetAP_RSSI = -50;
static int8_t lastRogueAP_TX = 20;

static int8_t getAdaptiveTXPower(int8_t targetRSSI) {
  if (targetRSSI == 0) return 20;
  int8_t txPower = targetRSSI + 10;
  if (txPower < 0) txPower = 2;
  if (txPower > 20) txPower = 20;
  return txPower;
}

static void applyAdaptiveRoguePower(int8_t targetRSSI) {
  int8_t newPower = getAdaptiveTXPower(targetRSSI);
  if (newPower != lastRogueAP_TX) {
    WiFi.setOutputPower(newPower / 20.0f * 20.5f);
    lastRogueAP_TX = newPower;
  }
}

